#include <iostream>
#include <locale.h>


int main7() {
    setlocale(LC_ALL, "Russian");
    std::cout << "********** Меню ресторана **********\n\n";
    int number;
    std::cout << "Введите день недели (от 1 до 7): ";
    std::cin >> number;

    if (number == 1) {
        std::cout << "Меню сегодня (понедельник):\n";
        std::cout << "Борщь\n" << "Салат \"Сельдь под шубой\"\n"<< "Докторская колбаса\n" << "Чай\n" << "\n";
    } 
    else if (number == 2) {
        std::cout << "Меню сегодня (вторник):\n";
        std::cout << "Харчо\n" << "Салат \"Оливье\"\n" << "Баварские колбаски с капустой\n" << "Морс\n" << "\n";
    }
    else if (number == 3) {
        std::cout << "Меню сегодня (срела):\n";
        std::cout << "Уха\n" << "Салат \"Мимоза\"\n" << "Салями\n" << "Сок\n" << "\n";
    } 
    else if (number == 4) {
        std::cout << "Меню сегодня (четверг):\n";
        std::cout << "Гороховый суп\n" << "Салат \"Цезарь\"с креветками\n" << "Куриная ножка с пюре\n" << "Морс\n" << "\n";
    } 
    else if (number == 5) {
        std::cout << "Меню сегодня (пятница):\n";
        std::cout << "Рассольник\n" << "Салат \"Винегрет\"\n" << "Пеперони\n" << "Кофе\n" << "\n";
    } 
    else if (number == 6) {
        std::cout << "Меню сегодня (суббота):\n";
        std::cout << "Солянка\n" << "Салат \"Греческий\"\n" << "Докторская колбаса\n" << "Лимонад\n" << "\n";
    } 
    else if (number == 7) {
        std::cout << "Меню сегодня (воскресенье):\n";
        std::cout << "Шурпе\n" << "Салат \"Чебоксарский\"\n" << "Шартан\n" << "Квас\n" << "\n";
    } 
    else {
        std::cout << "В неделе 7 дней!\n";
    }
    return 0;
}