#include <iostream>
#include <locale.h>

int main7() {
    setlocale(LC_ALL, "Russian");
    std::cout << "********** Меню ресторана **********\n\n";
    int number;
    std::cout << "Введите день недели (от 1 до 7): ";
    std::cin >> number;

    switch (number) {

    case 1:
        std::cout << "Меню сегодня (понедельник):\n";
        std::cout << "Борщь\n" << "Салат \"Сельдь под шубой\"\n" << "Докторская колбаса\n" << "Чай\n";
        break;

    case 2:
        std::cout << "Меню сегодня (вторник):\n";
        std::cout << "Харчо\n" << "Салат \"Оливье\"\n" << "Баварские колбаски с капустой\n" << "Морс\n";
        break;

    case 3:
        std::cout << "Меню сегодня (срела):\n";
        std::cout << "Уха\n" << "Салат \"Мимоза\"\n" << "Салями\n" << "Сок\n";
        break;

    case 4:
        std::cout << "Меню сегодня (четверг):\n";
        std::cout << "Гороховый суп\n" << "Салат \"Цезарь\"с креветками\n" << "Куриная ножка с пюре\n" << "Морс\n";
        break;

    case 5:
        std::cout << "Меню сегодня (пятница):\n";
        std::cout << "Рассольник\n" << "Салат \"Винегрет\"\n" << "Пеперони\n" << "Кофе\n";
        break;

    case 6:
        std::cout << "Меню сегодня (суббота):\n";
        std::cout << "Солянка\n" << "Салат \"Греческий\"\n" << "Докторская колбаса\n" << "Лимонад\n";
        break;

    case 7:
        std::cout << "Меню сегодня (воскресенье):\n";
        std::cout << "Шурпе\n" << "Салат \"Чебоксарский\"\n" << "Шартан\n" << "Квас\n";
        break;

    default:
        std::cout << "В неделе 7 дней!\n";
        break;
    } 
    return 0;
}